## Estadística Aplicada

Sesión 3 - 17 agosto

Oscar Gabriel Martínez Rodríguez 1962702

Grupo 43

# Tuplas

Colección de objetos que es inmutable (no se pueden cambiar una vez creadas)

In [1]:
#crear tupla

tupla_alumno = ('Oscar', 'Martinez', 20)

In [2]:
type(tupla_alumno)

tuple

## Diccionarios
clave(variable) : valor

In [3]:
d_alumno = {
    'Nombre' : 'Oscar',
    'Apellido' : 'Martinez'
}

In [4]:
type(d_alumno)

dict

In [5]:
grupo_metodosE = {
    'Nombre' : ['Ale', 'Ana', 'Alba'],
    'Edad' : [24, 19, 32],
}

In [6]:
grupo_metodosE.keys()

dict_keys(['Nombre', 'Edad'])

In [7]:
grupo_metodosE['Edad']

[24, 19, 32]

In [9]:
grupo_metodosE.values()

dict_values([['Ale', 'Ana', 'Alba'], [24, 19, 32]])

In [10]:
grupo_metodosE['Edad'][0]

24

## Pandas

Pandas está construido sobre numpy, por tanto, todas las funciones de numpy se pueden usar en pandas.

Pandas sirve para manejar datos estructurados, los cuales son de tres tipos:
1.  Series (unidimensionales)
2.  Dataframes (filas-columnas)
3.  Panel (filas-columnas, a través del tiempo)

In [11]:
import pandas as pd

Supongamos que conocemos las edades de: Juan 23, Jorge 18, Raúl 15, Omar 31

In [13]:
edades = [23,18,15,31]
edades

[23, 18, 15, 31]

In [14]:
edades = pd.Series(edades, index = ['Juan', 'Jorge', 'Raul', "Omar"])

In [15]:
edades

Juan     23
Jorge    18
Raul     15
Omar     31
dtype: int64

## Dataframe

Datos organizados en filas y columnas

In [17]:
alumno1 = ['Jorge', 'Perez', 21]
alumno2 = ['Ana', 'Rosas', 26]
alumno3 = ['Raul', 'Gomez',22]
alumno4 = ['Ana', 'Solis', 19]

In [18]:
clase_estadistica = [alumno1, alumno2, alumno3, alumno4]
clase_estadistica

[['Jorge', 'Perez', 21],
 ['Ana', 'Rosas', 26],
 ['Raul', 'Gomez', 22],
 ['Ana', 'Solis', 19]]

In [19]:
#convertirlo en dataframe
clase_estadistica = pd.DataFrame(clase_estadistica, columns= ['Nombre', 'Apellido', 'Edad'])
clase_estadistica

  Nombre Apellido  Edad
0  Jorge    Perez    21
1    Ana    Rosas    26
2   Raul    Gomez    22
3    Ana    Solis    19

In [20]:
clase_estadistica.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
clase_estadistica.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [22]:
clase_estadistica.shape

(4, 3)

In [23]:
clase_estadistica

  Nombre Apellido  Edad
0  Jorge    Perez    21
1    Ana    Rosas    26
2   Raul    Gomez    22
3    Ana    Solis    19

In [24]:
clase_estadistica['Municipio'] = ['Mty', 'Apodaca', 'Escobedo', 'Santiago']
clase_estadistica

  Nombre Apellido  Edad Municipio
0  Jorge    Perez    21       Mty
1    Ana    Rosas    26   Apodaca
2   Raul    Gomez    22  Escobedo
3    Ana    Solis    19  Santiago

In [25]:
clase_estadistica['Edad_dias'] = clase_estadistica['Edad'] * 365
clase_estadistica

  Nombre Apellido  Edad Municipio  Edad_dias
0  Jorge    Perez    21       Mty       7665
1    Ana    Rosas    26   Apodaca       9490
2   Raul    Gomez    22  Escobedo       8030
3    Ana    Solis    19  Santiago       6935

# Seleccionar elementos de un dataframe

1.  Selección estándar
2.  Selección .iloc
3.  Selección .loc
4.  Selección condicional

In [26]:
## seleccion estandar
#columnas
clase_estadistica['Edad']

0    21
1    26
2    22
3    19
Name: Edad, dtype: int64

In [27]:
clase_estadistica[['Edad', 'Nombre']]

   Edad Nombre
0    21  Jorge
1    26    Ana
2    22   Raul
3    19    Ana

In [29]:
#filas
#rango de filas
clase_estadistica[0:2]

  Nombre Apellido  Edad Municipio  Edad_dias
0  Jorge    Perez    21       Mty       7665
1    Ana    Rosas    26   Apodaca       9490

In [30]:
clase_estadistica['Nombre'][0:2]

0    Jorge
1      Ana
Name: Nombre, dtype: object

## seleccion .iloc (posicion)

dataframe.iloc[posicion filas, posicion columnas]

In [31]:
clase_estadistica.iloc[:,3]

0         Mty
1     Apodaca
2    Escobedo
3    Santiago
Name: Municipio, dtype: object

In [34]:
clase_estadistica.iloc[0]

Nombre       Jorge
Apellido     Perez
Edad            21
Municipio      Mty
Edad_dias     7665
Name: 0, dtype: object

In [35]:
clase_estadistica.iloc[2:4,[0,2]]

  Nombre  Edad
2   Raul    22
3    Ana    19

## seleccion .loc (etiquetas o nombres)

dataframe.loc[nombre filas, nombre columnas]

In [39]:
clase_estadistica = clase_estadistica.set_index('Municipio')

KeyError: "None of ['Municipio'] are in the columns"

In [40]:
clase_estadistica

          Nombre Apellido  Edad  Edad_dias
Municipio
Mty        Jorge    Perez    21       7665
Apodaca      Ana    Rosas    26       9490
Escobedo    Raul    Gomez    22       8030
Santiago     Ana    Solis    19       6935

In [41]:
clase_estadistica.loc[:,'Edad']

Municipio
Mty         21
Apodaca     26
Escobedo    22
Santiago    19
Name: Edad, dtype: int64

In [45]:
clase_estadistica.loc[['Apodaca', 'Mty']]

          Nombre Apellido  Edad  Edad_dias
Municipio
Apodaca      Ana    Rosas    26       9490
Mty        Jorge    Perez    21       7665

In [46]:
clase_estadistica.Apellido

Municipio
Mty         Perez
Apodaca     Rosas
Escobedo    Gomez
Santiago    Solis
Name: Apellido, dtype: object

## Seleccion condicional
Dataframe[condición]

In [52]:
clase_estadistica[clase_estadistica['Edad'] >= 20][clase_estadistica['Apellido'] == 'Perez']

C:\Users\DELL\AppData\Local\Temp\ipykernel_6212\2771690103.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  clase_estadistica[clase_estadistica['Edad'] >= 20][clase_estadistica['Apellido'] == 'Perez']

          Nombre Apellido  Edad  Edad_dias
Municipio
Mty        Jorge    Perez    21       7665

In [51]:
clase_estadistica.query('Edad >= 20 & Apellido == "Perez"')

          Nombre Apellido  Edad  Edad_dias
Municipio
Mty        Jorge    Perez    21       7665

In [53]:
#ordenar menor a mayor
clase_estadistica.sort_values('Edad')

          Nombre Apellido  Edad  Edad_dias
Municipio
Santiago     Ana    Solis    19       6935
Mty        Jorge    Perez    21       7665
Escobedo    Raul    Gomez    22       8030
Apodaca      Ana    Rosas    26       9490

In [54]:
#mayor a menor
clase_estadistica.sort_values('Edad', ascending= False)

          Nombre Apellido  Edad  Edad_dias
Municipio
Apodaca      Ana    Rosas    26       9490
Escobedo    Raul    Gomez    22       8030
Mty        Jorge    Perez    21       7665
Santiago     Ana    Solis    19       6935

In [55]:
clase_estadistica.sort_values('Apellido')

          Nombre Apellido  Edad  Edad_dias
Municipio
Escobedo    Raul    Gomez    22       8030
Mty        Jorge    Perez    21       7665
Apodaca      Ana    Rosas    26       9490
Santiago     Ana    Solis    19       6935

In [56]:
import numpy as np

In [57]:
clase_estadistica['Edad'].mean()

22.0

In [58]:
clase_estadistica['Edad'].sum()

88

In [59]:
round(clase_estadistica['Edad'].var(),1)

8.7

## np.where(condicion, valor si cumplo, valor si no se cumple)

In [62]:
#clasificar mayor y menor de edad
clase_estadistica['Mayoria_edad'] = np.where(clase_estadistica['Edad'] >= 18, 'Mayor', 'Menor')
clase_estadistica

          Nombre Apellido  Edad  Edad_dias Mayoria_edad
Municipio
Mty        Jorge    Perez    21       7665        Mayor
Apodaca      Ana    Rosas    26       9490        Mayor
Escobedo    Raul    Gomez    22       8030        Mayor
Santiago     Ana    Solis    19       6935        Mayor

## np.select(condiciones, valor condicion, valor si no se cumple ninguna condicion)

In [64]:
## 
condiciones = [clase_estadistica['Edad'] <= 17,
               clase_estadistica['Edad'] < 23,
               clase_estadistica['Edad'] >= 23]

valores = ['Prepa',
           'Universidad',
           'Trabajando']

clase_estadistica['situacion'] = np.select(condiciones, valores, 'nini')
clase_estadistica

          Nombre Apellido  Edad  Edad_dias Mayoria_edad    situacion
Municipio
Mty        Jorge    Perez    21       7665        Mayor  Universidad
Apodaca      Ana    Rosas    26       9490        Mayor   Trabajando
Escobedo    Raul    Gomez    22       8030        Mayor  Universidad
Santiago     Ana    Solis    19       6935        Mayor  Universidad

In [65]:
clase_estadistica[['Edad', 'situacion']]

           Edad    situacion
Municipio
Mty          21  Universidad
Apodaca      26   Trabajando
Escobedo     22  Universidad
Santiago     19  Universidad

In [69]:
clase_estadistica.groupby('situacion')['Edad'].mean().round(1)

situacion
Trabajando     26.0
Universidad    20.7
Name: Edad, dtype: float64

In [71]:
clase_estadistica.groupby('situacion')['Edad'].agg(['mean','count','std']).round(1)

             mean  count  std
situacion
Trabajando   26.0      1  NaN
Universidad  20.7      3  1.5